Autodesk.Revit.DB.DirectContext3D.ClipPlane.Normal
The plane's normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.ClipPlane.Origin
The plane's origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.ClipPlane.#ctor(Autodesk.Revit.DB.DirectContext3D.ClipPlane)
Constructs a copy of the clip plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017